                                                    # # 코딩테스트 = 큰수의 법칙
# lista = [2,4,5,4,6]
#     # 8번(M) 더하여 가장 큰 수를 만든다.
#     # 단 배열의 특정한 인덱스에 해당하는 수가 연속해서 3(k)번을 초과하여 더해질 수 없다.
#     # 결과 : 6+6+6+5+6+6+6+5 = 46
# lista = [3,4,3,4,3]
#     # 서로 다른 인덱스에 해당하는 수가 같은 경우에도 서로 다른 것으로 간주한다.
#     # M = 7 , K=2
#     # 결과 :4+4(인덱스1)+4+4(인덱스3)+4+4(인덱스1)+4(인덱스3)
# lista = []
# lista.sort(reverse=True)
# max_num = lista[0]
# .split('k')

def Fn():
    global a
    a = 10
    print(a)
Fn()
print(a) #전역변수 10출력